Revit.Application.Document.WorksharingPath
Gets the worksharing path of the current document

Revit.Application.Document.IsCloudPath
Whether the Worksharing path represents a path on an Autodesk server such as BIM360.

Revit.Application.Document.PurgeUnused(System.Boolean)
Purge unused Elements from the model.
fullPurge: Similar to clicking the purge button multiple times in Revit, the node will repeatedly purge until there is nothing left to remove.
Returns: Purged element ids

Revit.Application.Document.SaveFamilyToFolder(Revit.Elements.Family,System.String)
Saves all of the input families at a given location.
family: The Revit family to save
directoryPath: Directory to save the family to. If directory does not exist, it will be created.
Returns: File path of saved families